LEXICON_COMMANDS_RU: dict[str, str] = {
    '/start':'Перезапустить бота',
    '/unsub': 'Отменить подписку',
}

LEXICON_RU: dict[str, str] = {
    'stat': '📊Статистика',
    '/stat': '❤️Характеристики:\n\n'
             '💌Получено сообщений: {}\n'
             '✍️Отправлено сообщений: {}\n\n'
             '📊Вы лучше чем - {}% пользователей\n'
             '😎Ваша крутость - {} из 10\n\n'
             '🔗Запость личную ссылку, чтобы повысить эти характеристики: {}\n\n',
    '/i_see': '❌Понятно',
    'more_message': '💘Больше сообщений',
    '/more_message': '✔️Чтобы получать больше анонимных\n'
                    'сообщений - ты можешь размещать ссылку\n'
                    'во всех соц сетях!(VK|WhatsApp|TikTok|i\n'
                    'Instagram)\n\n'
                    '🔗Вот твоя ссылка - ',
    '/more_message1':'📊Чтобы узнать статистику - жми кнопку ниже',
    'change_link': '♻Сменить ссылку',
    '/change_link_text':'‼️Здесь ты сможешь дать имя своей ссылке\n'
                        'вместо ID {}\n\n'
                        '🔗На данный момент твоя ссылка выглядит\n'
                        'так: {}\n\n'
                        'Чтобы изменить имя-нажми "♻️\n'
                        'Изменить"👇',
    'get_link_true':'❌Данное имя занято другим\n\n'
                    'пользователем\n\n'
                    '♻️Введи другое имя...',
    'get_link_false':'✅Твое имя успешно изменено на {}\n\n'
                    '🔗Теперь твоя ссылка выглядит так: {}\n\n'
                    '⛓️Старая ссылка(‼️тоже работает): {}\n\n',
    '/start': '💕Получай анонимные сообщения от знакомых\n\n'
              '🔗Твоя индивидуальная ссылка:',
    '/start 1': '☝️Запость эту ссылку в Telegram-канале, или своём'
                ' профиле',
    '/deep_start': '💌Напиши прямо сюда в бота сообщение и\n'
                   'оно отправится человеку, который запостил\n'
                   'ссылку АНОНИМНО\n\n'
                   '✍️Можешь написать вопрос, признание, что\n' 
                   'угодно.⚠️<i>Главное, чтобы сообщение было\n'
                   'интересным</i>',
    'cancel_but': 'Отмена ❌',
    '/cancel_but_text': '❌Не пытайся отправить собщение сам\n'
                       'себе❌\n\n'
                       'Лучше запость личную ссылку в свои соц\n'
                       'сети👇👇👇\n\n'
                       ' 🔗Личная ссылка:',
    'answer': 'Ответить ✍',
    'answer_text': '📝 Напиши свой ответ на данное сообщение прямо в бота',
    'answer_send': '💝Твой ответ был отправлен!🔜(И он уже\n'
                   'пришел собеседнику)\n\n'
                   '<u>Жди от него ответ💭</u>',
    'get_name': 'Узнать имя 👀',
    'get_name_text': '👉 Временно не работает сея замечательная\n\n'
                     'функция. Мы работаем над этим.',
    'get_message': '📨 Получено сообщение!\n\n',
    'message_was_send': '❤️‍🔥Твое сообщение было отправлено!🔜(И\n'
                        'оно уже пришло получателю)\n\n'
                        'P.S. Тебе может прийти ответ на сообщение\n\n'
                        '⏳А чтобы не ждать...',
    'external_link': 'Переход по внешней ссылке или рестарт или понял',
    'back': 'Назад🔙',
    'change': '♻️Изменить',
    '/change': '👀А теперь напиши уникальное имя для своей ссылки...\n\n'
               '🚨Только английские буквы и цифры!\n'
               'Пример: naste4ka',
}

